





/*
 * SHARED STRINGS
 */

/*
 * ./ShadowsocksX-NG/PACUtils.swift
 */

"PAC has been updated by latest GFW List." = "PAC has been updated by latest GFW List.";

"Failed to download latest GFW List." = "Failed to download latest GFW List.";

"White List update succeed." = "White List update succeed.";

"Failed to download latest White List update succeed." = "Failed to download latest White List update succeed.";

/*
 * ./ShadowsocksX-NG/BunchImportUtils.swift
 */

"Import Server Profile succeed!" = "Import Server Profile succeed!";

"Successful import \(configsCount) items" = "Successful import \(configsCount) items";

"Import Server Profile failed!" = "Import Server Profile failed!";

"Invalid config file!" = "Invalid config file!";

/*
 * ./ShadowsocksX-NG/AppDelegate.swift
 */

"Add Shadowsocks Server Profile" = "Add Shadowsocks Server Profile";

"By scan QR Code" = "By scan QR Code";

"By Handle SS URL" = "By Handle SS URL";

" Encryption Method: \(profile.method)" = " Encryption Method: \(profile.method)";

"Current server profile is not valid." = "Current server profile is not valid.";

"No current server profile." = "No current server profile.";

"Proxy - Auto By PAC" = "Proxy - Auto By PAC";

"Proxy - Global" = "Proxy - Global";

"Proxy - Manual" = "Proxy - Manual";

"Proxy - White List Domain" = "Proxy - White List Domain";

"Proxy - White List IP" = "Proxy - White List IP";

"Shadowsocks: On" = "Shadowsocks: On";

"Turn Shadowsocks Off" = "Turn Shadowsocks Off";

"Shadowsocks: Off" = "Shadowsocks: Off";

"Turn Shadowsocks On" = "Turn Shadowsocks On";

/*
 * ./ShadowsocksX-NG/PreferencesWindowController.swift
 */

"New Server" = "New Server";

/*
 * ./ShadowsocksX-NG/UserRulesController.swift
 */

"PAC has been updated by User Rules." = "PAC has been updated by User Rules.";

"It's failed to update PAC by User Rules." = "It's failed to update PAC by User Rules.";

"Proxy - Manual" = "Proxy - Manual";

"Servers" = "Servers";
